<a href="https://colab.research.google.com/github/Ishikaaa/Machine-Learning-Assignments/blob/master/(Ass_9)Logistic_Regression.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# ***1. Creating Working Directory - ***

In [0]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt
import re

In [2]:
train=pd.read_csv("https://raw.githubusercontent.com/Shreyas3108/Titanic-EDA-and-Survival-prediction/master/train.csv ")
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
test=pd.read_csv("https://raw.githubusercontent.com/Shreyas3108/Titanic-EDA-and-Survival-prediction/master/test.csv")
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [85]:
dataset=pd.concat([train,test])
dataset.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450

In [5]:
dataset.columns

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket'],
      dtype='object')

In [0]:
dataset.shape

(1309, 12)

In [0]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
Age            1046 non-null float64
Cabin          295 non-null object
Embarked       1307 non-null object
Fare           1308 non-null float64
Name           1309 non-null object
Parch          1309 non-null int64
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Sex            1309 non-null object
SibSp          1309 non-null int64
Survived       891 non-null float64
Ticket         1309 non-null object
dtypes: float64(3), int64(4), object(5)
memory usage: 132.9+ KB

# ***2. Remove NaN values from the column ‘Survived’ - ***

In [0]:
dataset.isnull().sum()

Age             263
Cabin          1014
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived        418
Ticket            0
dtype: int64

In [0]:
dataset.dropna(subset=['Survived'],inplace=True)

In [87]:
dataset.shape

(891, 12)

# ***3. Create a new column 'Has_Cabin' - ***

In [0]:
dataset['Has_Cabin']=dataset['Cabin'].notnull().astype(int)

In [89]:
print("Shape:",dataset.shape,end="\n\n")
print("Name of Columns:",dataset.columns,end="\n\n")
print("Dateset:")
print(dataset.head())

Shape: (891, 13)

Name of Columns: Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket', 'Has_Cabin'],
      dtype='object')

Dateset:
    Age Cabin Embarked     Fare  \
0  22.0   NaN        S   7.2500
1  38.0   C85        C  71.2833
2  26.0   NaN        S   7.9250
3  35.0  C123        S  53.1000
4  35.0   NaN        S   8.0500

                                                Name  Parch  PassengerId  \
0                            Braund, Mr. Owen Harris      0            1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...      0            2
2                             Heikkinen, Miss. Laina      0            3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)      0            4
4                           Allen, Mr. William Henry      0            5

   Pclass     Sex  SibSp  Survived            Ticket  Has_Cabin
0       3    male      1       0.0         A/5 21171          0
1       1  female      1       1.0          PC 17599          1
2       3  female      0       1.0  STON/O2. 3101282          0
3       1  female      1       1.0            113803          1
4       3    male      0       0.0            373450          0

# ***4. Create a new column “Title” - ***

In [0]:
dataset['Title']=dataset['Name']

In [91]:
def regexp(name):
  tit=['Mr', 'Mrs', 'Master', 'Miss', 'Special']
  for i in range(0,891):
    a=name[i]
    if re.search(r'(a-zA-Z)*Mrs.(a-zA-Z)*',a):
      name[i]='Mrs'
    elif re.search(r'(a-zA-Z)*Mr.(a-zA-Z)*',a):  
      name[i]='Mr'
    elif re.search(r'(a-zA-Z)*Master.(a-zA-Z)*',a):  
      name[i]='Master'
    elif re.search(r'(a-zA-Z)*Miss.(a-zA-Z)*',a):  
      name[i]='Miss'
    else:  
      name[i]='Special'
      
np.apply_along_axis(regexp, 0,dataset['Title'])
print(dataset['Title'])

0           Mr
1          Mrs
2         Miss
3          Mrs
4           Mr
5           Mr
6           Mr
7       Master
8          Mrs
9          Mrs
10        Miss
11        Miss
12          Mr
13          Mr
14        Miss
15         Mrs
16      Master
17          Mr
18         Mrs
19         Mrs
20          Mr
21          Mr
22        Miss
23          Mr
24        Miss
25         Mrs
26          Mr
27          Mr
28        Miss
29          Mr
        ...
861         Mr
862        Mrs
863       Miss
864         Mr
865        Mrs
866       Miss
867         Mr
868         Mr
869     Master
870         Mr
871        Mrs
872         Mr
873         Mr
874        Mrs
875       Miss
876         Mr
877         Mr
878         Mr
879        Mrs
880        Mrs
881         Mr
882       Miss
883         Mr
884         Mr
885        Mrs
886    Special
887       Miss
888       Miss
889         Mr
890         Mr
Name: Title, Length: 891, dtype: object

In [92]:
dataset['Title'].value_counts()

Mr         518
Miss       180
Mrs        129
Master      40
Special     24
Name: Title, dtype: int64

In [93]:
print("Shape:",dataset.shape,end="\n\n")
print("Name of columns:",dataset.columns,end="\n\n")
print("Dataset:")
print(dataset.head())

Shape: (891, 14)

Name of columns: Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket', 'Has_Cabin', 'Title'],
      dtype='object')

Dataset:
    Age Cabin Embarked     Fare  \
0  22.0   NaN        S   7.2500
1  38.0   C85        C  71.2833
2  26.0   NaN        S   7.9250
3  35.0  C123        S  53.1000
4  35.0   NaN        S   8.0500

                                                Name  Parch  PassengerId  \
0                            Braund, Mr. Owen Harris      0            1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...      0            2
2                             Heikkinen, Miss. Laina      0            3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)      0            4
4                           Allen, Mr. William Henry      0            5

   Pclass     Sex  SibSp  Survived            Ticket  Has_Cabin Title
0       3    male      1       0.0         A/5 21171          0    Mr
1       1  female      1       1.0          PC 17599          1   Mrs
2       3  female      0       1.0  STON/O2. 3101282          0  Miss
3       1  female      1       1.0            113803          1   Mrs
4       3    male      0       0.0            373450          0    Mr

# ***5. Impute the missing values - ***

In [94]:
dataset.isnull().sum()

Age            177
Cabin          687
Embarked         2
Fare             0
Name             0
Parch            0
PassengerId      0
Pclass           0
Sex              0
SibSp            0
Survived         0
Ticket           0
Has_Cabin        0
Title            0
dtype: int64

In [0]:
dataset=dataset.fillna(0)

In [96]:
dataset.isnull().sum()

Age            0
Cabin          0
Embarked       0
Fare           0
Name           0
Parch          0
PassengerId    0
Pclass         0
Sex            0
SibSp          0
Survived       0
Ticket         0
Has_Cabin      0
Title          0
dtype: int64

# ***6. Create two new columns “Categorical_age” and “Categorical_fare” -***

In [0]:
dataset['Categorical_age']=pd.qcut(dataset['Age'],3,labels=['A','B','C',])

In [98]:
print("Shape:",dataset.shape,end="\n\n")
print("Name of column:",dataset.columns,end="\n\n")
print("dataset:")
print(dataset.head())

Shape: (891, 15)

Name of column: Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket', 'Has_Cabin', 'Title',
       'Categorical_age'],
      dtype='object')

dataset:
    Age Cabin Embarked     Fare  \
0  22.0     0        S   7.2500
1  38.0   C85        C  71.2833
2  26.0     0        S   7.9250
3  35.0  C123        S  53.1000
4  35.0     0        S   8.0500

                                                Name  Parch  PassengerId  \
0                            Braund, Mr. Owen Harris      0            1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...      0            2
2                             Heikkinen, Miss. Laina      0            3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)      0            4
4                           Allen, Mr. William Henry      0            5

   Pclass     Sex  SibSp  Survived            Ticket  Has_Cabin Title  \
0       3    male      1       0.0         A/5 21171          0    Mr
1       1  female      1       1.0          PC 17599          1   Mrs
2       3  female      0       1.0  STON/O2. 3101282          0  Miss
3       1  female      1       1.0            113803          1   Mrs
4       3    male      0       0.0            373450          0    Mr

  Categorical_age
0               B
1               C
2               B
3               C
4               C

In [0]:
dataset['Categorical_fare']=pd.qcut(dataset['Fare'],3,labels=['A','B','C'])

In [100]:
print("Shape:",dataset.shape,end="\n\n")
print("Name of column:",dataset.columns,end="\n\n")
print("Dataset:")
print(dataset.head())

Shape: (891, 16)

Name of column: Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket', 'Has_Cabin', 'Title',
       'Categorical_age', 'Categorical_fare'],
      dtype='object')

Dataset:
    Age Cabin Embarked     Fare  \
0  22.0     0        S   7.2500
1  38.0   C85        C  71.2833
2  26.0     0        S   7.9250
3  35.0  C123        S  53.1000
4  35.0     0        S   8.0500

                                                Name  Parch  PassengerId  \
0                            Braund, Mr. Owen Harris      0            1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...      0            2
2                             Heikkinen, Miss. Laina      0            3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)      0            4
4                           Allen, Mr. William Henry      0            5

   Pclass     Sex  SibSp  Survived            Ticket  Has_Cabin Title  \
0       3    male      1       0.0         A/5 21171          0    Mr
1       1  female      1       1.0          PC 17599          1   Mrs
2       3  female      0       1.0  STON/O2. 3101282          0  Miss
3       1  female      1       1.0            113803          1   Mrs
4       3    male      0       0.0            373450          0    Mr

  Categorical_age Categorical_fare
0               B                A
1               C                C
2               B                A
3               C                C
4               C                A

# ***7. Drop columns Cabin, Name, Passengerid, Ticket, Age, Fare, SibSp, Parch -***

In [0]:
dataset.drop(labels=['Cabin', 'Name', 'PassengerId', 'Ticket', 'Age', 'Fare', 'SibSp', 'Parch'],axis=1,inplace=True)

In [102]:
print("Shape:",dataset.shape,end='\n\n')
print("Name of Columns:",dataset.columns,end='\n\n')
print("Dataset:")
print(dataset.head())

Shape: (891, 8)

Name of Columns: Index(['Embarked', 'Pclass', 'Sex', 'Survived', 'Has_Cabin', 'Title',
       'Categorical_age', 'Categorical_fare'],
      dtype='object')

Dataset:
  Embarked  Pclass     Sex  Survived  Has_Cabin Title Categorical_age  \
0        S       3    male       0.0          0    Mr               B
1        C       1  female       1.0          1   Mrs               C
2        S       3  female       1.0          0  Miss               B
3        S       1  female       1.0          1   Mrs               C
4        S       3    male       0.0          0    Mr               C

  Categorical_fare
0                A
1                C
2                A
3                C
4                A

# ***8. Transform all variables into numeric ones using get_dummies() - ***

In [49]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 8 columns):
Embarked            891 non-null object
Pclass              891 non-null int64
Sex                 891 non-null object
Survived            891 non-null float64
Has_Cabin           891 non-null int64
Title               891 non-null object
Categorical_age     891 non-null category
Categorical_fare    891 non-null category
dtypes: category(2), float64(1), int64(2), object(3)
memory usage: 50.7+ KB

In [0]:
dataset=pd.get_dummies(dataset,columns=['Embarked'],drop_first=True)

In [76]:
dataset.head()

,Pclass,Sex,Survived,Has_Cabin,Title,Categorical_age,Categorical_fare,Embarked_C,Embarked_Q,Embarked_S
0,3,male,0.0,0,Mr,B,A,0,0,1
1,1,female,1.0,1,Mrs,C,C,1,0,0
2,3,female,1.0,0,Miss,B,A,0,0,1
3,1,female,1.0,1,Mrs,C,C,0,0,1
4,3,male,0.0,0,Mr,C,A,0,0,1

In [0]:
dataset=pd.get_dummies(dataset,columns=['Sex'],drop_first=True)
dataset=pd.get_dummies(dataset,columns=['Title'],drop_first=True)
dataset=pd.get_dummies(dataset,columns=['Categorical_age'],drop_first=True)
dataset=pd.get_dummies(dataset,columns=['Categorical_fare'],drop_first=True)

In [78]:
dataset.head()

,Pclass,Survived,Has_Cabin,Embarked_C,Embarked_Q,Embarked_S,Sex_male,Title_Miss,Title_Mr,Title_Mrs,Title_Special,Categorical_age_B,Categorical_age_C,Categorical_fare_B,Categorical_fare_C
0,3,0.0,0,0,0,1,1,0,1,0,0,1,0,0,0
1,1,1.0,1,1,0,0,0,0,0,1,0,0,1,0,1
2,3,1.0,0,0,0,1,0,1,0,0,0,1,0,0,0
3,1,1.0,1,0,0,1,0,0,0,1,0,0,1,0,1
4,3,0.0,0,0,0,1,1,0,1,0,0,0,1,0,0

In [105]:
print("Shape:",dataset.shape,end="\n\n")
print("Name of Columns:",dataset.columns)

Shape: (891, 15)

Name of Columns: Index(['Pclass', 'Survived', 'Has_Cabin', 'Embarked_C', 'Embarked_Q',
       'Embarked_S', 'Sex_male', 'Title_Miss', 'Title_Mr', 'Title_Mrs',
       'Title_Special', 'Categorical_age_B', 'Categorical_age_C',
       'Categorical_fare_B', 'Categorical_fare_C'],
      dtype='object')

# ***9. Splitting dataset into training and test set - ***

In [106]:
Y=dataset['Survived']
X=dataset
X.drop(labels=['Survived'],axis=1,inplace=True)
X,Y

(     Pclass  Has_Cabin  Embarked_C  Embarked_Q  Embarked_S  Sex_male  \
 0         3          0           0           0           1         1
 1         1          1           1           0           0         0
 2         3          0           0           0           1         0
 3         1          1           0           0           1         0
 4         3          0           0           0           1         1
 5         3          0           0           1           0         1
 6         1          1           0           0           1         1
 7         3          0           0           0           1         1
 8         3          0           0           0           1         0
 9         2          0           1           0           0         0
 10        3          1           0           0           1         0
 11        1          1           0           0           1         0
 12        3          0           0           0           1         1
 13        3          0           0           0           1         1
 14        3          0           0           0           1         0
 15        2          0           0           0           1         0
 16        3          0           0           1           0         1
 17        2          0           0           0           1         1
 18        3          0           0           0           1         0
 19        3          0           1           0           0         0
 20        2          0           0           0           1         1
 21        2          1           0           0           1         1
 22        3          0           0           1           0         0
 23        1          1           0           0           1         1
 24        3          0           0           0           1         0
 25        3          0           0           0           1         0
 26        3          0           1           0           0         1
 27        1          1           0           0           1         1
 28        3          0           0           1           0         0
 29        3          0           0           0           1         1
 ..      ...        ...         ...         ...         ...       ...
 861       2          0           0           0           1         1
 862       1          1           0           0           1         0
 863       3          0           0           0           1         0
 864       2          0           0           0           1         1
 865       2          0           0           0           1         0
 866       2          0           1           0           0         0
 867       1          1           0           0           1         1
 868       3          0           0           0           1         1
 869       3          0           0           0           1         1
 870       3          0           0           0           1         1
 871       1          1           0           0           1         0
 872       1          1           0           0           1         1
 873       3          0           0           0           1         1
 874       2          0           1           0           0         0
 875       3          0           1           0           0         0
 876       3          0           0           0           1         1
 877       3          0           0           0           1         1
 878       3          0           0           0           1         1
 879       1          1           1           0           0         0
 880       2          0           0           0           1         0
 881       3          0           0           0           1         1
 882       3          0           0           0           1         0
 883       2          0           0           0           1         1
 884       3          0           0           0           1         1
 885       3          0           0           1           0         0
 886       2          0           0           0           1         1
 887       1          1           0           0           1         0
 888       3          0           0           0           1         0
 889       1          1           1           0           0         1
 890       3          0           0           1           0         1

      Title_Miss  Title_Mr  Title_Mrs  Title_Special  Categorical_age_B  \
 0             0         1          0              0                  1
 1             0         0          1              0                  0
 2             1         0          0              0                  1
 3             0         0          1              0                  0
 4             0         1          0              0                  0
 5             0         1          0              0                  0
 6             0         1          0              0                  0
 7             0         0          0              0                  0
 8             0         0          1              0                  1
 9             0         0          1              0                  0
 10            1         0          0              0                  0
 11            1         0          0              0                  0
 12            0         1          0              0                  1
 13            0         1          0              0                  0
 14            1         0          0              0                  0
 15            0         0          1              0                  0
 16            0         0          0              0                  0
 17            0         1          0              0                  0
 18            0         0          1              0                  1
 19            0         0          1              0                  0
 20            0         1          0              0                  0
 21            0         1          0              0                  0
 22            1         0          0              0                  0
 23            0         1          0              0                  1
 24            1         0          0              0                  0
 25            0         0          1              0                  0
 26            0         1          0              0                  0
 27            0         1          0              0                  1
 28            1         0          0              0                  0
 29            0         1          0              0                  0
 ..          ...       ...        ...            ...                ...
 861           0         1          0              0                  1
 862           0         0          1              0                  0
 863           1         0          0              0                  0
 864           0         1          0              0                  1
 865           0         0          1              0                  0
 866           1         0          0              0                  1
 867           0         1          0              0                  1
 868           0         1          0              0                  0
 869           0         0          0              0                  0
 870           0         1          0              0                  1
 871           0         0          1              0                  0
 872           0         1          0              0                  0
 873           0         1          0              0                  0
 874           0         0          1              0                  1
 875           1         0          0              0                  0
 876           0         1          0              0                  1
 877           0         1          0              0                  1
 878           0         1          0              0                  0
 879           0         0          1              0                  0
 880           0         0          1              0                  1
 881           0         1          0              0                  0
 882           1         0          0              0                  1
 883           0         1          0              0                  1
 884           0         1          0              0                  1
 885           0         0          1              0                  0
 886           0         0          0              1                  1
 887           1         0          0              0                  1
 888           1         0          0              0                  0
 889           0         1          0              0                  1
 890           0         1          0              0                  0

      Categorical_age_C  Categorical_fare_B  Categorical_fare_C
 0                    0                   0                   0
 1                    1                   0                   1
 2                    0                   0                   0
 3                    1                   0                   1
 4                    1                   0                   0
 5                    0                   0                   0
 6                    1                   0                   1
 7                    0                   1                   0
 8                    0                   1                   0
 9                    0                   0                   1
 10                   0                   1                   0
 11                   1                   0                   1
 12                   0                   0                   0
 13                   1                   0                   1
 14                   0                   0                   0
 15                   1                   1                   0
 16                   0                   0                   1
 17                   0                   1                   0
 18                   0                   1                   0
 19                   0                   0                   0
 20                   1                   1                   0
 21                   1                   1                   0
 22                   0                   0                   0
 23                   0                   0                   1
 24                   0                   1                   0
 25                   1                   0                   1
 26                   0                   0                   0
 27                   0                   0                   1
 28                   0                   0                   0
 29                   0                   0                   0
 ..                 ...                 ...                 ...
 861                  0                   1                   0
 862                  1                   1                   0
 863                  0                   0                   1
 864                  0                   1                   0
 865                  1                   1                   0
 866                  0                   1                   0
 867                  0                   0                   1
 868                  0                   1                   0
 869                  0                   1                   0
 870                  0                   0                   0
 871                  1                   0                   1
 872                  1                   0                   0
 873                  1                   1                   0
 874                  0                   1                   0
 875                  0                   0                   0
 876                  0                   1                   0
 877                  0                   0                   0
 878                  0                   0                   0
 879                  1                   0                   1
 880                  0                   1                   0
 881                  1                   0                   0
 882                  0                   1                   0
 883                  0                   1                   0
 884                  0                   0                   0
 885                  1                   0                   1
 886                  0                   1                   0
 887                  0                   0                   1
 888                  0                   1                   0
 889                  0                   0                   1
 890                  1                   0                   0

 [891 rows x 14 columns], 0      0.0
 1      1.0
 2      1.0
 3      1.0
 4      0.0
 5      0.0
 6      0.0
 7      0.0
 8      1.0
 9      1.0
 10     1.0
 11     1.0
 12     0.0
 13     0.0
 14     0.0
 15     1.0
 16     0.0
 17     1.0
 18     0.0
 19     1.0
 20     0.0
 21     1.0
 22     1.0
 23     1.0
 24     0.0
 25     1.0
 26     0.0
 27     0.0
 28     1.0
 29     0.0
       ...
 861    0.0
 862    1.0
 863    0.0
 864    0.0
 865    1.0
 866    1.0
 867    0.0
 868    0.0
 869    1.0
 870    0.0
 871    1.0
 872    0.0
 873    0.0
 874    1.0
 875    1.0
 876    0.0
 877    0.0
 878    0.0
 879    1.0
 880    1.0
 881    0.0
 882    0.0
 883    0.0
 884    0.0
 885    0.0
 886    0.0
 887    1.0
 888    0.0
 889    1.0
 890    0.0
 Name: Survived, Length: 891, dtype: float64)

In [107]:
from sklearn.model_selection import train_test_split 
X_train,X_test,Y_train,Y_test=train_test_split(X,Y,test_size=0.25,random_state=0)
X_train,X_test,Y_train,Y_test

(     Pclass  Has_Cabin  Embarked_C  Embarked_Q  Embarked_S  Sex_male  \
 105       3          0           0           0           1         1
 68        3          0           0           0           1         0
 253       3          0           0           0           1         1
 320       3          0           0           0           1         1
 706       2          0           0           0           1         0
 271       3          0           0           0           1         1
 424       3          0           0           0           1         1
 752       3          0           0           0           1         1
 615       2          0           0           0           1         0
 2         3          0           0           0           1         0
 882       3          0           0           0           1         0
 467       1          0           0           0           1         1
 403       3          0           0           0           1         1
 258       1          0           1           0           0         0
 720       2          0           0           0           1         0
 272       2          0           0           0           1         0
 154       3          0           0           0           1         1
 832       3          0           1           0           0         1
 820       1          1           0           0           1         0
 382       3          0           0           0           1         1
 20        2          0           0           0           1         1
 585       1          1           0           0           1         0
 65        3          0           1           0           0         1
 680       3          0           0           1           0         0
 878       3          0           0           0           1         1
 304       3          0           0           0           1         1
 823       3          1           0           0           1         0
 521       3          0           0           0           1         1
 333       3          0           0           0           1         1
 698       1          1           1           0           0         1
 ..      ...        ...         ...         ...         ...       ...
 72        2          0           0           0           1         1
 845       3          0           0           0           1         1
 537       1          0           1           0           0         0
 677       3          0           0           0           1         0
 849       1          1           1           0           0         0
 874       2          0           1           0           0         0
 174       1          1           1           0           0         1
 87        3          0           0           0           1         1
 551       2          0           0           0           1         1
 486       1          1           0           0           1         0
 705       2          0           0           0           1         1
 314       2          0           0           0           1         1
 396       3          0           0           0           1         0
 600       2          0           0           0           1         0
 472       2          0           0           0           1         0
 70        2          0           0           0           1         1
 599       1          1           1           0           0         1
 804       3          0           0           0           1         1
 754       2          0           0           0           1         0
 277       2          0           0           0           1         1
 723       2          0           0           0           1         1
 9         2          0           1           0           0         0
 359       3          0           0           1           0         0
 707       1          1           0           0           1         1
 763       1          1           0           0           1         0
 835       1          1           1           0           0         0
 192       3          0           0           0           1         0
 629       3          0           0           1           0         1
 559       3          0           0           0           1         0
 684       2          0           0           0           1         1

      Title_Miss  Title_Mr  Title_Mrs  Title_Special  Categorical_age_B  \
 105           0         1          0              0                  1
 68            1         0          0              0                  0
 253           0         1          0              0                  1
 320           0         1          0              0                  1
 706           0         0          1              0                  0
 271           0         1          0              0                  1
 424           0         1          0              0                  0
 752           0         1          0              0                  0
 615           1         0          0              0                  1
 2             1         0          0              0                  1
 882           1         0          0              0                  1
 467           0         1          0              0                  0
 403           0         1          0              0                  1
 258           1         0          0              0                  0
 720           1         0          0              0                  0
 272           0         0          1              0                  0
 154           0         1          0              0                  0
 832           0         1          0              0                  0
 820           0         0          1              0                  0
 382           0         1          0              0                  0
 20            0         1          0              0                  0
 585           1         0          0              0                  0
 65            0         0          0              0                  0
 680           1         0          0              0                  0
 878           0         1          0              0                  0
 304           0         1          0              0                  0
 823           0         0          1              0                  1
 521           0         1          0              0                  1
 333           0         1          0              0                  0
 698           0         1          0              0                  0
 ..          ...       ...        ...            ...                ...
 72            0         1          0              0                  1
 845           0         1          0              0                  0
 537           1         0          0              0                  1
 677           1         0          0              0                  0
 849           0         0          1              0                  0
 874           0         0          1              0                  1
 174           0         1          0              0                  0
 87            0         1          0              0                  0
 551           0         1          0              0                  1
 486           0         0          1              0                  0
 705           0         1          0              0                  0
 314           0         1          0              0                  0
 396           1         0          0              0                  1
 600           0         0          1              0                  1
 472           0         0          1              0                  0
 70            0         1          0              0                  0
 599           0         1          0              0                  0
 804           0         1          0              0                  1
 754           0         0          1              0                  0
 277           0         1          0              0                  0
 723           0         1          0              0                  0
 9             0         0          1              0                  0
 359           1         0          0              0                  0
 707           0         1          0              0                  0
 763           0         0          1              0                  0
 835           1         0          0              0                  0
 192           1         0          0              0                  1
 629           0         1          0              0                  0
 559           0         0          1              0                  0
 684           0         1          0              0                  0

      Categorical_age_C  Categorical_fare_B  Categorical_fare_C
 105                  0                   0                   0
 68                   0                   0                   0
 253                  0                   1                   0
 320                  0                   0                   0
 706                  1                   1                   0
 271                  0                   0                   0
 424                  0                   1                   0
 752                  1                   1                   0
 615                  0                   0                   1
 2                    0                   0                   0
 882                  0                   1                   0
 467                  1                   0                   1
 403                  0                   1                   0
 258                  1                   0                   1
 720                  0                   0                   1
 272                  1                   1                   0
 154                  0                   0                   0
 832                  0                   0                   0
 820                  1                   0                   1
 382                  1                   0                   0
 20                   1                   1                   0
 585                  0                   0                   1
 65                   0                   1                   0
 680                  0                   0                   0
 878                  0                   0                   0
 304                  0                   0                   0
 823                  0                   1                   0
 521                  0                   0                   0
 333                  0                   1                   0
 698                  1                   0                   1
 ..                 ...                 ...                 ...
 72                   0                   0                   1
 845                  1                   0                   0
 537                  0                   0                   1
 677                  0                   1                   0
 849                  0                   0                   1
 874                  0                   1                   0
 174                  1                   0                   1
 87                   0                   0                   0
 551                  0                   1                   0
 486                  1                   0                   1
 705                  1                   1                   0
 314                  1                   0                   1
 396                  0                   0                   0
 600                  0                   0                   1
 472                  1                   0                   1
 70                   1                   1                   0
 599                  1                   0                   1
 804                  0                   0                   0
 754                  1                   0                   1
 277                  0                   0                   0
 723                  1                   1                   0
 9                    0                   0                   1
 359                  0                   0                   0
 707                  1                   0                   1
 763                  1                   0                   1
 835                  1                   0                   1
 192                  0                   0                   0
 629                  0                   0                   0
 559                  1                   1                   0
 684                  1                   0                   1

 [668 rows x 14 columns],
      Pclass  Has_Cabin  Embarked_C  Embarked_Q  Embarked_S  Sex_male  \
 495       3          0           1           0           0         1
 648       3          0           0           0           1         1
 278       3          0           0           1           0         1
 31        1          1           1           0           0         0
 255       3          0           1           0           0         0
 298       1          1           0           0           1         1
 609       1          1           0           0           1         0
 318       1          1           0           0           1         0
 484       1          1           1           0           0         1
 367       3          0           1           0           0         0
 704       3          0           0           0           1         1
 346       2          0           0           0           1         0
 196       3          0           0           1           0         1
 535       2          0           0           0           1         0
 310       1          1           1           0           0         0
 14        3          0           0           0           1         0
 350       3          0           0           0           1         1
 145       2          0           0           0           1         1
 614       3          0           0           0           1         1
 803       3          0           1           0           0         1
 144       2          0           0           0           1         1
 708       1          0           0           0           1         0
 778       3          0           0           1           0         1
 270       1          0           0           0           1         1
 474       3          0           0           0           1         0
 319       1          1           1           0           0         0
 519       3          0           0           0           1         1
 141       3          0           0           0           1         0
 880       2          0           0           0           1         0
 642       3          0           0           0           1         0
 ..      ...        ...         ...         ...         ...       ...
 727       3          0           0           1           0         0
 428       3          0           0           1           0         1
 54        1          1           1           0           0         1
 45        3          0           0           0           1         1
 172       3          0           0           0           1         0
 447       1          0           0           0           1         1
 597       3          0           0           0           1         1
 204       3          0           0           0           1         1
 240       3          0           1           0           0         0
 672       2          0           0           0           1         1
 39        3          0           1           0           0         0
 283       3          0           0           0           1         1
 308       2          0           1           0           0         1
 18        3          0           0           0           1         0
 769       3          0           0           0           1         1
 156       3          0           0           1           0         0
 482       3          0           0           0           1         1
 210       3          0           0           0           1         1
 647       1          1           1           0           0         1
 50        3          0           0           0           1         1
 852       3          0           1           0           0         0
 239       2          0           0           0           1         1
 646       3          0           0           0           1         1
 122       2          0           1           0           0         1
 788       3          0           0           0           1         1
 167       3          0           0           0           1         0
 306       1          0           1           0           0         0
 379       3          0           0           0           1         1
 742       1          1           1           0           0         0
 10        3          1           0           0           1         0

      Title_Miss  Title_Mr  Title_Mrs  Title_Special  Categorical_age_B  \
 495           0         1          0              0                  0
 648           0         1          0              0                  0
 278           0         0          0              0                  0
 31            0         0          1              0                  0
 255           0         0          1              0                  1
 298           0         1          0              0                  0
 609           1         0          0              0                  0
 318           1         0          0              0                  1
 484           0         1          0              0                  1
 367           0         0          1              0                  0
 704           0         1          0              0                  1
 346           1         0          0              0                  0
 196           0         1          0              0                  0
 535           1         0          0              0                  0
 310           1         0          0              0                  1
 14            1         0          0              0                  0
 350           0         1          0              0                  1
 145           0         1          0              0                  1
 614           0         1          0              0                  0
 803           0         0          0              0                  0
 144           0         1          0              0                  0
 708           1         0          0              0                  1
 778           0         1          0              0                  0
 270           0         1          0              0                  0
 474           1         0          0              0                  1
 319           0         0          1              0                  0
 519           0         1          0              0                  0
 141           1         0          0              0                  1
 880           0         0          1              0                  1
 642           1         0          0              0                  0
 ..          ...       ...        ...            ...                ...
 727           1         0          0              0                  0
 428           0         1          0              0                  0
 54            0         1          0              0                  0
 45            0         1          0              0                  0
 172           1         0          0              0                  0
 447           0         1          0              0                  0
 597           0         1          0              0                  0

# ***10. Use logistic regression -***

In [108]:
from sklearn.linear_model import LogisticRegression
classifier=LogisticRegression()
classifier.fit(X_train,Y_train)

/usr/local/lib/python3.6/dist-packages/sklearn/linear_model/logistic.py:433: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='warn',
          n_jobs=None, penalty='l2', random_state=None, solver='warn',
          tol=0.0001, verbose=0, warm_start=False)

# ***11. Put the accuracy score - ***

In [109]:
score=classifier.score(X_test,Y_test)
score

0.8116591928251121

**Note - **


1.   81% accuracy is there.